Merge pull request #3 from duchenpaul/doc
Update README: mermaid diagram and tables
